Repository: rnapoles/trunk-qooxdoo-contrib-code
Catalog: qooxdoo-contrib/Translation/1.1/showcase/*.po
Languages: nl

source: Form Elements
nl: Formulier Elementen

source: Territory code:
nl: Land-id:

source: Localized ComboBox:
nl: Gelokaliseerde ComboBox:

source: Cut
nl: Knippen

source: Paste
nl: Plakken

source: Copy
nl: Kopiëren

source: A date:
nl: Een datum:

source: Undo
nl: Ongedaan maken

source: Redo
nl: Terugplaatsen

source: Delete
nl: Verwijderen

source: Select All
nl: Selecteer Alles

source: Search
nl: Zoeken

source: Search Again
nl: Opnieuw Zoeken

source: Command Menu (keyboard shortcuts)
nl: Opdracht Menu (sneltoetsen)

source: Locale Information
nl: Lokaliseringsinformatie

source: Locale:
nl: Taalherkenning:

source: Date format short:
nl: Korte datumnotatie:

source: Date short:
nl: Datum (kort):

source: Date format medium:
nl: Medium datumnotatie:

source: Date medium:
nl: Datum (medium):

source: Date format long:
nl: Lange datumnotatie:

source: Date long:
nl: Datum (lang):

source: Date format full:
nl: Volledige datumnotatie:

source: Date full:
nl: Datum (volledig):

source: Time format short:
nl: Korte tijdnotatie:

source: Time short:
nl: Tijd (kort):

source: Time format long:
nl: Lange tijdnotatie:

source: Time long:
nl: Tijd (lang):

source: Week start:
nl: Start van week:

source: Format of %1:
nl: Formaat van %1:
