Repository: rnapoles/trunk-qooxdoo-contrib-code
Catalog: trunk/qooxdoo-contrib/Translation/1.1/playground/*.po
Languages: nl

source: Unfortunately, an unrecoverable internal error was caused by your code. This may prevent the playground application to run properly.||
nl: Helaas was een onherstelbare interne fout veroorzaakt door uw code. Dit kan voorkomen dat de speeltuin correct werkt.||Kopieer uw code, herstart de speeltuin en plak uw code.||

source: You changed the code of the current sample.|Click OK to discard your changes.
nl: Je hebt de code van het huidig voorbeeld veranderd.|Klik OK om je veranderingen ongedaan te maken.

source: Custom Code
nl: Aangepaste Code

source: // Could not handle URL parameter! // %1
nl: // Kon niet omgaan met deze URL-parameter! // %1

source: // Your browser has a length restriction of the URL parameter which could have caused the problem.
nl: // Uw browser heeft een lengte beperking van de URL-parameter en zou de oorzaak van het probleem kunnen zijn.

source: No such user found.
nl: Geen gebruiker gevonden.

source: Starting application
nl: Applicatie aan het opstarten

source: Successfully started
nl: Met success opgestart

source: %1 (modified)
nl: %1 (gewijzigd)

source: Source Code
nl: Broncode

source: Playground
nl: Speeltuin

source: Run
nl: Uitvoeren

source: Run the source code
nl: Broncode uitvoeren

source: Samples
nl: Voorbeelden

source: Select a sample
nl: Selecteer een voorbeeld

source: Syntax Highlighting
nl: Syntaxisaccentuering

source: Log
nl: Logboek

source: Show log output
nl: Toon logboek inhoud

source: Shorten URL
nl: Verkort URL

source: Use tinyurl to shorten the url.
nl: Gebruik tinyurl om de URL te verkorten.

source: API Viewer
nl: API Zichter

source: Open the qooxdoo API Viewer
nl: Open de qooxdoo API Zichter

source: Manual
nl: Handboek

source: Open the qooxdoo Manual
nl: Open het qooxdoo handboek

source: Activate filter for [qx]
nl: Activeer filter voor [qx]

source: Loading...
nl: Laden...

source: Username
nl: Gebruikersnaam
