Repository: rnapoles/trunk-qooxdoo-contrib-code
Catalog: trunk/qooxdoo-contrib/qooxdoo-rtl/trunk/translation/*.po
Languages: ar

source: Native context menu allowed
ar: قائمة سياق أصلية متاحة

source: plain label
ar: تسمية عادية

source: <b>rich</b> label
ar: <b>غنية</b> تسمية

source: text field
ar: حقل النص

source: No native context menu
ar: لا يوجد قائمة سياق أصلية

source: Content
ar: المحتوى

source: DOM align control
ar: DOM محاذاة تحكم

source: DOM Popup
ar: DOM منبثقة

source: Open DOM-Popup
ar: DOM فتح منبثقة

source: The quick brown fox jumps over the lazy dog
ar: يقفز الثعلب البني السريع فوق الكلب الكسول

source: Select Font
ar: اختر الخط

source: Widget Properties
ar: خصائص التطبيقات المصغرة

source: Selected Widget
ar: التطبيقات المصغرة المختارة

source: layout properties
ar: خصائص التصميم

source: properties
ar: خصائص

source: null
ar: خالي

source: <p style="color:green;">You clicked on cell %1 / %2</p>
ar: <p style="color:green;">ضغطت على الخلية %1 / %2</p>

source: <p style="color:yellow;">You rightclicked cell %1 / %2</p>
ar: <p style="color:yellow;">نقرت باليمين الخلية %1 / %2</p>

source: <p style="color:red;">You double clicked cell %1 / %2</p>
ar: <p style="color:red;">النقر المزدوج خلية %1 / %2</p>

source: HTML Cells
ar: HTML خانات

source: Widget Cells
ar: التطبيقات المصغرة خانات

source: This is a feed reader!
ar: !هذا قارئ موجز

source: Sorted and filtered model
ar: نموذج مرتب و مصفى

source: Gallery (widgets)
ar: (widgets) معرض

source: Gallery (HTML - divs)
ar: (HTML - divs) معرض

source: <b>Grouped List</b><br/>Loads the json file <a href='json/persons.json' target='_blank'>persons.json</a> and binds the created model to all list widgets. The first list shows only the row data and uses a converter for the label that concatenates the first and last name. The second list sorts the items by last name and groups the items by the first letter of the last name. The third list sorts the items by first name and groups it by the 'group' model property. The third list is configured to use a customized group item for rendering.
ar: </br> ويربط جميع القوائم بالنموذج الذي تم انشاؤه. القائمة الأولى تظهر فقط صف بيانات وتستخدم محول لجمع الإسم واللقب. و القائمة الثانية ترتب العناصر حسب اللقب و تجمع العناصر بالحرف الأول من كل لقب. القائمة الثالثة ترتب العناصر بالإسم وتجمعهم بميزة 'group' للنموذج. القائمة الثالثة مهيأة لإستخدام مجموعة مختصة من العناصر للتقديم. <a href='json/persons.json' target='_blank'>persons.json</a> يقوم بتحميل الملف JSON <b>قائمة مجمعة</b>

source: Raw List:
ar: :قائمة خام

source: Grouped by last name:
ar: :مجمعة حسب اسم العائلة

source: Grouped by group:
ar: :مجمعة حسب المجموعة

source: Foo
ar: فو

source: Bar
ar: شريط

source: Even/Odd Colors
ar: ألوان زوجية / فردية

source: Custom Colors
ar: ألوان مخصصة

source: Even/Odd & Custom Colors
ar: ألوان زوجية / فردية و مخصصة

source: Simple
ar: بسيط

source: Long text
ar: نص طويل

source: Random Value %1
ar: %1 قيمة عشوائية

source: Empty Item
ar: عنصر فارغ

source: Option %1
ar: الخيار 1 ٪

source: Sorted
ar: مرتب ابجديا

source: Item
ar: عنصر

source: Filtered
ar: مصفى

source: Grouped with Persons
ar: مجمعة بالأشخاص

source: Row Selection
ar: اختيار الصف

source: Column Selection
ar: اختيار العمود

source: Cell Rectangle Selection
ar: اختيار خلية مستطيلة

source: Cell Line Selection
ar: اختيار خلية سطر

source: Selection Mode
ar: طريقة الإختيار

source: Options
ar: خيارات

source: Apple
ar: تفاحة

source: Carrot
ar: جزر

source: Potato
ar: بطاطا

source: Fruits
ar: فواكه

source: Vegetables
ar: خضراوات

source: Control
ar: تحكم

source: Selection:
ar: خيار

source: Open mode:
ar: طريقة الفتح

source: Selection:
ar: :التحديد

source: Enable multi selection
ar: إتاحة الاختيار المتعدد

source: Enable drag selection
ar: إتاحة سحب الاختيار

source: Root node:
ar: عقدة الجذر :

source: Hide Root Node
ar: .إخفاء العقدة الجذر

source: Show top level open/close icons
ar: إظهار أيقونات فتح / إغلاق في أعلى مستوى

source: Tree:
ar: شجرة

source: Show Leafs
ar: اعرض الاوراق

source: Update Model
ar: تحديث النموذج

source: File #%1
ar: ملف # 1 ٪

source: Toggle Height
ar: تبديل الارتفاع

source: Root
ar: جذر

source: Presets
ar: الإعدادات المسبقة

source: Lists
ar: قوائم

source: Personal
ar: شخصي

source: Big
ar: كبير

source: Loading
ar: تحميل

source: Icon Left
ar: يسار الرمز او الايقونة

source: Icon Top
ar: أعلى الرمز او الايقونة

source: Icon Right
ar: يمين الرمز او الايقونة

source: Icon Bottom
ar: أسفل الرمز او الايقونة

source: Atom Without Label
ar: ذرة بدون تسمية

source: Atom Without Icon
ar: ذرة بدون أيقونة

source: Atom With Long Label
ar: ذرة مع تسمية طويلة

source: Wider Atom
ar: ذرة أوسع

source: Higher Atom
ar: ذرة أعلى

source: Button A
ar: الزر A

source: Button B
ar: الزر B

source: Hover
ar: تحويم

source: Resize the windows to see the effect.
ar: .قم بتغيير حجم النوافذ لرؤية النتيجة

source: Window containing a Canvas - static coordinates
ar: نافذة تحتوي على لوحة - إحداثيات ثابتة

source: Canvas is not supported by this browser!
ar: !اللوحة غير معتمدة على هذا المتصفح

source: Window containing a Canvas - synced coordinates
ar: نافذة تحتوي على لوحة - إحداثيات متزامنة

source: Canvas is not support by this browser!
ar: !اللوحة غير معتمدة على هذا المتصفح

source: What do you need for the beach?
ar: ماذا تحتاج للشاطئ؟

source: Sun Oil
ar: للشمس زيت

source: Towel
ar: منشفة

source: Beer
ar: ماء

source: Bathing togs
ar: ثياب الاستحمام

source: OK
ar: موافق

source: You need these things for the beach: %1
ar: %1 :كنت بحاجة لهذه الأشياء للشاطئ

source: Are you sure you need nothing for the beach?
ar: هل أنت متأكد من أنك لا تحتاج لأي شيء على الشاطئ؟

source: Open Popup
ar: فتح منبثقة

source: Selected Color
ar: اللون المحدد

source: <b>value:</b>
ar: <b>:القيمة</b>

source: Default
ar: افتراضي

source: With icons
ar: مع أيقونات

source: %1's Icon
ar: %1 أيقونة

source: With HTML (rich) text
ar: HTML مع نص غني

source: ... &gt; (as literal HTML entity)
ar: ... &gt; (HTML ككيان حرفي)

source: ... &gt; (as Richtext)
ar: ... &gt; (كنص غني)

source: <b>Bold Text</b>
ar: <b>خط عريض</b>

source: <u>Underlined Text</u>
ar: <u>تحته خط</u>

source: <i>Italic Text</i>
ar: <i>خط مائل</i>

source: HTML entities: &laquo; &lt; &amp; &gt; &raquo;
ar: HTML الكيانات: &laquo; &lt; &amp; &gt; &raquo;

source: Wide, long list
ar: قائمة طويلة و متسعة

source: %1's Item
ar: %1 بند

source: select a date
ar: اختر تاريخا

source: Change: %1
ar: %1 :التغيير

source: Execute: %1
ar: %1 :تنفيذ

source: Set current date
ar: ادخل الوقت الحالي

source: Show January 1981
ar: إظهار يناير 1981

source: Remove the selection
ar: ألغي الاختيار

source: - Use the cursors keys to move the selection.
ar: .استخدم مفاتيح المؤشرات لنقل التحديد-

source: - Page-keys / shift + page-keys switch months/years.
ar: .مفاتيح الصفحات/شفت + مفاتيح الصفحات لتغيير الشهر/السنة-

source: - Double-click or enter/space-key will fire an execute event.
ar: .نقر مزدوج / مفتاح المساحة سيشغل حدث التنفيذ-

source: - Escape will remove the selection.
ar: .سيتم إزالة الاختيار باستخدام المفتاح الهروب-

source: With date formater
ar: مع المنسق التاريخ

source: Set data
ar: تحديد البيانات

source: Get data
ar: إحضار البيانات

source: Get date
ar: الحصول على التاريخ

source: Simple demo with FlashVars
ar: FlashVars عرض بسيط مع

source: Two way communication (ActionScript <-> JavaScript)
ar: (ActionScript <-> JavaScript) الاتصال في اتجاهين

source: Flash Player Version
ar: إصدار مشغل الفلاش

source: this is passed in via FlashVars
ar: FlashVars يتم تمرير هذا عبر

source: Show Flash Player version
ar: إظهار نسخة فلاش بلاير

source: Message from Flash:
ar: رسالة من الفلاش :

source: No message.
ar: .لا توجد رسالة

source: Message to Flash:
ar: رسالة الى فلاش :

source: qooxdoo is the best!
ar: qooxdoo هو الأفضل!

source: Send to Flash
ar: ارسل الى الفلاش

source: Flash:
ar: :الفلاش

source: Couldn't connect to Flash Player! Please make sure that: 1) no pop-up or advertising blocker is activated. 2) this html page is not loaded from the file system, but a webserver.
ar: :تعذر الاتصال لمشغل فلاش! يرجى التأكد مما يلي . لم يتم تفعيل مانع المنبثقة أو الدعاية (1 2).لم يتم تحميل هذه الصفحة من نظام الملفات، ولكن من مزود ويب

source: Code Assist
ar: كود المساعدة

source: Show debugging content
ar: إظهار محتوى التصحيح

source: Enable code completion
ar: إتاحة إتمام الكود

source: Show debugging console
ar: إظهار وحدة التحكم في التصحيح

source: Expert Settings
ar: خبير الإعدادات

source: Option #1
ar: الخيار # 1

source: Default Settings
ar: الإعدادات الافتراضية

source: Custom Settings
ar: إعدادات مخصصة

source: Advanced Settings
ar: خيارات إضافية

source: <h1>HtmlArea UI-level widget</h1><p>This UI-level widget can be used at RIA (Rich Internet Applications) and inline applications.<br/>The UI widget does use the low-level component internally so code-duplication is avoided.<br/>As an application developer you can <b>use the same API.</b></p><p>You can play around with this widget by hitting the buttons at the toolbar.</p>
ar: <h1> منطقة هتمل على مستوى واجهة المستخدم</h1>

source: <h1>About</h1><p>qooxdoo (pronounced [ku:ksdu:]) is a comprehensive and innovative Ajax application framework. Leveraging object-oriented JavaScript allows developers to build impressive cross-browser applications. No <acronym title="HyperText Markup Language">HTML</acronym>, <acronym title="Cascading Style Sheets">CSS</acronym> nor <acronym title="Document Object Model">DOM</acronym> knowledge is needed. qooxdoo includes a platform-independent development tool chain, a state-of-the-art <acronym title="Graphical User Interface">GUI</acronym> toolkit and an advanced client-server communication layer. It is Open Source under an <acronym title="GNU Lesser General Public License">LGPL</acronym>/<acronym title="Eclipse Public License">EPL</acronym> dual <a href="http://qooxdoo.org/license" class="wikilink1" title="license">license</a>.</p>
ar: <h1>حول</h1>كوكسدو (تنطق [كوكس دو]) هو إطار تطبيق أجاكس شامل ومبتكر, زيادة فعالية الشيئية جافا سكريبت يتيح للمطورين بناء تطبيقات مثيرة للإعجاب وتعمل على أي متصفح. كوكسدو تتضمن منصة سلسلة أدوات مستقلة للتنمية، وهي من بين أحدث أدوات واجهة المستخدم الرسومية، و تتضمن أيضا طبقة لاتصالات العميل خادم. لا حاجة لمعرفة سي أس أس، هاش تي أم ال، أو دوم, هي مصدر مفتوح بموجب ترخيص ال جي بي ال/اي بي ال المزدوج.

source: Color (Hex):
ar: (Hex): اللون

source: qooxdoo logo
ar: qooxdoo شعار

source: First Row, First cell
ar: أول صف , أول خلية

source: First Row, Second cell
ar: أول صف , ثاني خلية

source: Second Row, First cell
ar: ثاني صف , أول خلية

source: Second Row, Second cell
ar: ثاني صف , ثاني خلية

source: Insert Hyperlink
ar: ادخال رابط

source: HTML Code:
ar: HTML :كود بلغة

source: Change Font Family
ar: تغيير عائلة الخط

source: Change Font Size
ar: تغيير حجم الخط

source: Format Bold
ar: تنسيق عريض

source: Format Italic
ar: تنسيق مائل

source: Format Underline
ar: تنسيق تحته خط

source: Format Strikethrough
ar: شكل يتوسطه خط

source: Remove Format
ar: إزالة تنسيق

source: Align Left
ar: محاذاة لليسار

source: Align Center
ar: توسيط

source: Align Right
ar: محاذاة لليمين

source: Align Justify
ar: ضبط محاذاة

source: Set Text Color
ar: تعيين لون النص

source: Set Text Background Color
ar: تعيين لون خلفية النص

source: Indent More
ar: المسافة البادئة أكثر

source: Indent Less
ar: المسافة البادئة أقل

source: Insert Image
ar: إدراج صورة

source: Insert Table
ar: إدراج جدول

source: Insert Link
ar: إدراج رابط

source: Insert HTML Code
ar: إدراج كود اتش تمل

source: Insert Horizontal Ruler
ar: إدراج مسطرة أفقية

source: Insert Ordered List
ar: إدراج قائمة مرتبة

source: Inserted Unordered List
ar: أدرجت قائمة غير مرتبة

source: Undo Last Change
ar: التراجع عن آخر تغيير

source: Redo Last Undo Step
ar: إعادة التراجع عن الخطوة الأخيرة

source: <div style='background-color: white; text-align: center;'><i style='color: red;'><b>H</b></i><b>T</b><u>M</u><i>L</i> Text</div>
ar: <div style='background-color: white; text-align: center;'><i style='color: red;'><b>H</b></i><b>T</b><u>M</u><i>L</i> نص</div>

source: Text with set font (bold)!
ar: النص مع مجموعة الخط غامق

source: local
ar: محلي

source: Toggle enabled
ar: تبديل متاح

source: text label
ar: نص التسمية

source: configure text label
ar: تهيئة نص التسمية

source: rich label
ar: تسمية غنية

source: configure rich label
ar: تهيئة تسمية غنية

source: My First Long Label Cutted
ar: تسمية لي طويلة مقصوصة أول

source: A long label text with auto-wrapping. This also may contain <b style='color:red'>rich HTML</b> markup.
ar: <b style='color:red'> غني HTML</b> نص التسمية طويل مع التفاف تلقائي. و قد يتضمن أيضا علامات

source: Big Long Label
ar: تسمية كبيرة طويلة

source: Big Long Label Cutted
ar: تسمية كبيرة طويلة مقصوصة

source: value
ar: القيمة

source: selectable
ar: للتحديد

source: native context menu
ar: قائمة السياق الأصلية

source: rich
ar: غني

source: Show Label
ar: إظهار التسمية

source: Show Icon
ar: إظهار الأيقونة

source: Show Both
ar: إظهار كلاهما

source: Horizontal, Icons only
ar: أفقي، أيقونات فقط

source: Folder %1
ar: المجلد ٪ 1

source: move to
ar: الانتقال إلى

source: command %1
ar: %1 أمر

source: Option 1
ar: الخيار 1

source: Option 2
ar: الخيار 2

source: Option 3
ar: الخيار 3

source: Action 1
ar: الاجراء 1

source: Action 2
ar: الاجراء 2

source: Action 3
ar: الاجراء 3

source: Actions
ar: أحداث

source: Menu Button
ar: زر القائمة

source: Website 1
ar: الموقع 1

source: Website 2
ar: الموقع 2

source: Website 3
ar: الموقع 3

source: Split Button
ar: زر منقسم

source: Back
ar: للخلف

source: Line 313
ar: السطر 313

source: Line 1039
ar: السطر 1039

source: Line 12
ar: السطر 12

source: Line 26
ar: السطر 26

source: Line 431
ar: السطر 431

source: Line 30
ar: السطر 30

source: Enabled
ar: تفعيل

source: Search
ar: بحث

source: View
ar: عرض

source: Format
ar: تنسيق

source: Open
ar: فتح

source: Close
ar: اغلاق

source: Save as...
ar: حفظ باسم

source: Print
ar: طباعة

source: Exit
ar: خروج

source: Undo
ar: تراجع

source: Redo
ar: إعادة

source: Search...
ar: بحث

source: Search next...
ar: بحث التالي

source: Search previous...
ar: البحث السابق...

source: Replace
ar: استبدل

source: Search in files
ar: بحث داخل الملفات

source: Replace in files
ar: استبدل في الملفات

source: Panes
ar: الأجزاء

source: Syntax
ar: بناء الجملة

source: Show ruler
ar: إظهار المسطرة

source: Show line numbers
ar: إظهار أرقام الأسطر

source: ASCII table
ar: جدول أسكي

source: Show tabs
ar: إظهار علامات تبويب

source: Show status bar
ar: إظهار شريط الحالة

source: Show tree
ar: إظهار شجرة

source: Show macros
ar: إظهار وحدات الماكرو

source: Show tags
ar: إظهار العلامات

source: Show console
ar: إظهار وحدة التحكم

source: HTML
ar: هتمل

source: XML
ar: ملف XML

source: JavaScript
ar: جافا سكريبت

source: C Dialect
ar: C اللهجة

source: Perl
ar: بيرل

source: Python
ar: بايثون

source: C Sharp
ar: لغة السي شارب

source: C Plus Plus
ar: بلاس بلاس C

source: Paragraph
ar: فقرة

source: Tabs to spaces
ar: المفتاح تاب للمسافة

source: Spaces to tabs
ar: مسافات إلى تبويبات

source: Uppercase
ar: الأحرف الكبيرة

source: Lowercase
ar: الأحرف الصغيرة

source: Capitals
ar: حروف كبيرة

source: OEM to ANSI
ar: OEM إلى ANSI

source: ANSI to OEM
ar: ANSI إلى OEM

source: Left aligned
ar: محاذاة إلى اليسار

source: Right aligned
ar: محاذاة إلى اليمين

source: Centered
ar: في المركز

source: Justified
ar: مبرر

source: Topics
ar: المواضيع

source: Quickstart
ar: البداية السريعة

source: Online Forum
ar: منتدى الانترنت

source: Info...
ar: ...معلومات

source: Open Popup #1
ar: افتح المنبثقة # 1

source: Hello World #1
ar: مرحبا بالعالم # 1

source: Open Popup #2
ar: افتح المنبثقة # 2

source: Completed: 0 (0%)
ar: (0%) 0 :أنجزت

source: Completed: %1 (%2%)
ar: (%2%) %1 :أنجزت

source: What is your favorite color?
ar: ما هو لونك المفضل؟

source: Yellow
ar: اصفر

source: Your favorite color is: %1
ar: %1 : لونك المفضل هو

source: <strong>Vertical:</strong>
ar: <strong> :عمودي</strong>

source: Red
ar: احمر

source: Green
ar: اخضر

source: Blue
ar: ازرق

source: <strong>Horizontal:</strong>
ar: <strong> :أفقي</strong>

source: <strong>Grid:</strong>
ar: <strong> :الشبكة</strong>

source: Option number %1
ar: %1 الخيار رقم

source: Resize me I'm resizable
ar: غير لي حجمي أنا متغير الحجم

source: Value:
ar: قيمة

source: Value: %1
ar: القيمة : %1

source: Min: %1
ar: الحد الأدنى : %1

source: Max: %1
ar: الحد الأقصى : %1

source: Not Editable
ar: غير قابل للتحرير

source: Wrap
ar: لف

source: Stepped
ar: صعدت

source: Disabled
ar: معطل

source: Number format
ar: شكل العدد

source: Toggle Splitpane Orientation
ar: تبديل اتجاه Splitpane

source: Show first pane
ar: إظهار الجزء الأول

source: Show second pane
ar: إظهار الجزء الثاني

source: Show both panes
ar: إظهار كلى الجزأين

source: Offset (%1):
ar: (%1) :إزاحة

source: Previous
ar: السابقة

source: Next
ar: القادم

source: Layout
ar: تصميم

source: Layout-Settings
ar: إعدادات التصميم

source: Notes
ar: ملاحظات

source: Notes...
ar: ...ملاحظات

source: Calculator
ar: آلة حاسبة

source: Calculator...
ar: ...آلة حاسبة

source: Help
ar: مساعدة

source: Help...
ar: ...مساعدة

source: Page #%1
ar: %1 # الصفحة

source: Bar Position
ar: موقع الشريط

source: top
ar: فوق

source: bottom
ar: اسفل

source: left
ar: يسار

source: right
ar: يمين

source: Add new page
ar: اضف صفحة جديدة

source: Remove first page
ar: الغي الصفحة الاولى

source: Remove last page
ar: الغي الصفحة الاخيرة

source: Web 2.0
ar: الويب 2.0

source: read only
ar: للقراءة فقط

source: text area
ar: مجال النص

source: text area nowrap
ar: مجال النص بدون التفاف

source: text area monospace
ar: مجال النص أحادية المساحة

source: Toggle live update
ar: تبديل التحديث الحي

source: Use the following buttons to interact with the <b>first textfield</b> widget.
ar: التطبيق المصغر <b>حقل النص الأول</b> استخدام الأزرار التالية للتفاعل مع

source: Send content
ar: إرسال المحتوى

source: Send selection
ar: أرسل الاختيار

source: Send start of selection
ar: أرسل بداية الاختيار

source: Send end of selection
ar: أرسل نهاية الاختيار

source: New
ar: جديد

source: Copy
ar: نسخ

source: Cut
ar: قص

source: Paste
ar: لصق

source: Toggle
ar: تبديل

source: Left
ar: يسار

source: Center
ar: وسط

source: Right
ar: يمين

source: More...
ar: المزيد..

source: 22px
ar: 22بكسل

source: 32px
ar: 32بكسل

source: 48px
ar: 48بكسل

source: Icon Size:
ar: حجم الأيقونة :

source: Label and Icon
ar: التسمية وأيقونة

source: Icon only
ar: أيقونة فقط

source: Label only
ar: تسمية فقط

source: Show:
ar: اظهر

source: on
ar: مفتوح

source: Overflow handling:
ar: معالجة تجاوز السعة :

source: Shared ToolTip
ar: تلميح أداة مشتركة

source: Shared tool tip of button #
ar: تلميح أداة مشتركة من الزر # 1

source: Button #1 (Shared ToolTip)
ar: (الزر # 1 (تلميح أداة مشتركة

source: Button #2 (Shared ToolTip)
ar: (الزر # 2 (تلميح أداة مشتركة

source: Icon only ToolTip
ar: تلميح أداة بإيقونة فقط

source: ToolTip with icon and label
ar: تلميح أداة بإيقونة و تسمية

source: Hello World #3
ar: مرحبا العالم # 3

source: Such a great tooltip with a (show) timeout of 50ms.
ar: .أداة تلميح رائعة تظهر لمدة 50 جزءا من الألف من الثانية

source: Short timeout ToolTip
ar: أداة تلميح لوقت قصير

source: A long label text with auto-wrapping. This also may contain <b style='color:red'>rich HTML</b> markup and with a (show) timeout of 50ms.
ar: .يظهر لمدة 50 جزءا من الألف من الثانية <b style='color:red'> HTML نص</b> و قد يحتوي أيضا على .نص تسمية طويل مع التفاف تلقائي

source: ToolTip with icon and rich text
ar: تلميح أداة بإيقونة و نص غني

source: Button with ToolTipText
ar: زر مع نص أداة تلميح

source: Tooltip text
ar: نص أداة تلميح

source: Button with ToolTipIcon
ar: زر مع أيقونة أداة تلميح

source: Button with ToolTipText and ToolTipIcon
ar: زر مع نص أداة تلميح و أيقونة أداة تلميح

source: root
ar: جذر

source: Junk #%1
ar: %غير هام # 1

source: %1 items
ar: %1 العناصر

source: Show root open button
ar: .إظهار زر فتح الأصل

source: Show Items
ar: اظهر العناصر

source: Show Open Items
ar: عرض العناصر المفتوحة

source: Show Selected Items
ar: عرض العناصر المحددة

source: Chat
ar: محادثة

source: Pustefix
ar: نفاخة فقاقيع

source: Announce
ar: إعلان

source: Devel
ar: تطوير

source: Relations
ar: علاقة

source: Questions
ar: الاسئلة

source: Internal
ar: داخلي

source: Products
ar: منتجات

source: Press
ar: اضغط

source: Development
ar: تطوير

source: Competition
ar: منافسة

source: Bugs
ar: الأخطاء

source: Family
ar: عائلة

source: Projects
ar: مشاريع

source: Holiday
ar: عطلة

source: May %1 2005
ar: 2005 %1 ماي

source: First Window
ar: النافذة الاولى

source: Demo loaded
ar: تم تحميل العرض

source: Welcome to your first own Window.<br/>Have fun!
ar: نرحب بك في نافذتك الأولى. <BR/>وقتا ممتعا!

source: Page 1
ar: صفحة 1

source: Page 2
ar: صفحة 2

source: Page 3
ar: صفحة 3

source: Second Window
ar: نافذة ثانية

source: Application is ready
ar: التطبيق جاهز

source: The second window
ar: النافذة الثانية

source: Basics
ar: مبادئ

source: Show Close
ar: عرض زر إغلاق

source: Show Maximize
ar: إظهار تكبير

source: Show Minimize
ar: إظهار تصغير

source: Allow Close
ar: امكانية الاغلاق

source: Allow Maximize
ar: امكانية التكبير

source: Allow Minimize
ar: امكانية التصغير

source: Show Statusbar
ar: إظهار شريط الحالة

source: Resizable
ar: يمكن تغيير حجم

source: Use resize frame
ar: استعمال تغيير حجم الإطار

source: Resizable %1
ar: يمكن تغيير حجم %1

source: Moveable
ar: متحرك

source: Movable
ar: متحرك

source: Use move frame
ar: استعمل الاطار المتحرك

source: Third Window
ar: النافذة الثالثة

source: Open Modal Dialog 1
ar: فتح مربع حوار مشروط 1

source: First Modal Dialog
ar: أول مربع حوار مشروط

source: Open Modal Dialog 2
ar: فتح مربع حوار مشروط 2

source: Modal
ar: مشروط

source: Second Modal Dialog
ar: مربع حوار مشروط ثاني

source: Do you want to fly to Berlin?
ar: هل تريد السفر إلى برلين؟

source: Yes
ar: نعم

source: No
ar: لا

source: Sorry, please click 'Yes'!
ar: عفوا , الرجاء انقر نعم
