Repository: rnapoles/trunk-qooxdoo-contrib-code
Catalog: trunk/qooxdoo-contrib/qooxdoo-rtl/trunk/translation/*.po
Languages: ar

source: Filter...
ar: ...تصفية

source: Info
ar: معلومات

source: Unable to access namespace. Maybe no demo loaded.
ar: .غير قادر على الوصول إلى مساحة الاسم. ربما لم يتم تحميل العرض

source: Could not open the Playground.
ar: .لا يمكن فتح الملعب

source: Demo has been disposed.
ar: .تم التخلص من العرض

source: Unable to access application.
ar: .غير قادر على الوصول للتطبيق

source: Run
ar: تشغيل

source: Run the selected demo(s)
ar: تشغيل العروض المختارة

source: Stop
ar: توقف

source: Stop playback after current demo
ar: إيقاف تشغيل بعد العرض التجريبي الحالي

source: Run previous demo
ar: تشغيل العرض التجريبي السابق

source: Run next demo
ar: تشغيل العرض التجريبي التالي

source: Own Window
ar: النافذة الخاصة

source: Open demo in new window
ar: فتح عرض في نافذة جديدة

source: To Playground
ar: إلى الملعب.

source: Open demo in the playground
ar: فتح عرض في الملعب

source: API Viewer
ar: عارض ال API

source: Open the qooxdoo API Viewer
ar: فتح المعهد qooxdoo عارض

source: Manual
ar: دليل

source: Open the qooxdoo Manual
ar: فتح المختصر qooxdoo

source: Available locales
ar: متاح لغات

source: Modern Theme
ar: الحديث الموضوع

source: Classic Theme
ar: كلاسيك الموضوع

source: Simple Theme
ar: الموضوع بسيط

source: Theme
ar: موضوع

source: Choose theme
ar: اختيار السمة

source: Object Summary
ar: كائن ملخص

source: Dispose Demo
ar: التصرف تجريبي

source: Hide/Show Tests Demos
ar: إخفاء / إظهار الاختبارات ديموس

source: Debug
ar: التصحيح

source: Debugging options
ar: خيارات التصحيح

source: HTML Code
ar: HTML كود بلغة

source: Display HTML source
ar: HTML عرض مصدر

source: JS Code
ar: JS كود

source: Display JavaScript source
ar: عرض المصدر جافا سكريبت

source: Log File
ar: ملف السجل

source: Display log file
ar: عرض ملف السجل

source: <div class='script'>The sample source will be displayed here.</div>
ar: <div class='script'>.سيتم عرض نموذج المصدر هنا</div>

source: <div class='script'>The sample JS source will be displayed here.</div>
ar: <div class='script'>.سيتم عرض مصدر نموذج جافا سكريبت هنا</div>

source: Demos
ar: العروض

source: Demo Link
ar: عرض وصله

source: Get Demo Link
ar: الحصول على رابط تجريبي

source: Demo Browser
ar: متصفح العرض التوضيحي

source: Start
ar: بداية

source: Failed to load demo data from the file system. The security settings of your browser may prohibit AJAX when using the file protocol. Please try the http protocol instead.
ar: .فشل في تحميل البيانات التجريبية من نظام الملفات .قد ضبط أمن المتصفح لديك بحيث يحظر اجاكس عند استخدام بروتوكول الملف. يرجى المحاولة ببروتوكول هتتب بدلا من ذلك

source: Demo Browser
ar: متصفح العرض التوضيحي

source: Readme
ar: إقرأني

source: All
ar: الكل

source: Login
ar: دخول

source: close
ar: إغلاق

source: Lorem ipsum dolor sit amet, consectetuer sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Duis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum dolor sit amet, consectetuer adipiscing elit, sed diam nonummy nibh euismod tincidunt ut laoreet dolore magna aliquam erat volutpat. Ut wisi enim ad minim veniam, quis nostrud exerci tation ullamcorper suscipit lobortis nisl ut aliquip ex ea commodo consequat. Duis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi
ar: كليلة ودمنة (باب الحمامة المطوقة) زعموا أنه كان بأرض سكاوندجين، عند مدينة داهر، مكان كثير الصيد، ينتابه الصيادون؛ وكان في ذلك المكان شجرة كثيرة الأغصان ملتفة الورق فيها وكر غراب فبينما هو ذات يوم ساقط في وكره إذ بصر بصياد قبيح المنظر، سيئ الخلق، على عاتقه شبكة، وفي يده عصاً مقبلاً نحو الشجرة، فذعر منه الغراب؛ وقال: لقد ساق هذا الرجل إلى هذا المكان: إما حيني وإما حين غيري. فلأثبتن مكاني حتى أنظر ماذا يصنع. ثم إن الصياد نصب شبكته، ونثر عليها الحب، وكمن قريبا منها، فلم يلبث إلا قليلا، حتى مرت به حمامة يقال لها المطوقة، وكانت سيدة الحمام ومعها حمام كثير؛ فعميت هي وصواحبها عن الشرك، فوقعن على الحبِّ يلتقطنه فعلقن في الشبكة كلهن؛ وأقبل الصياد فرحاً مسروراً. فجعلت كل حمامة تضطرب في حبائلها وتلتمس الخلاص لنفسها. قالت المطوقة: لا تخاذلنا في المعالجة ولا تكن نفس إحداكن أهم إليها م نفس صاحبتها؛ ولكن نتعاون جميعاً فنقلع الشبكة فينجو بعضنا ببعض؛ فقلعن الشبكة جميعهن بتعاونهن، وعلون في الجو؛ ولم يقطع الصياد رجاءه منهن وظن أنهن لا يجاوزن إلا قريباً ويقعن. فقال الغراب: لأتبعهن وأنظرو ما يكون منهن. فالتفتت المطوقة فرأت الصياد يتبعهن. فقالت للحمام: هذا الصياد مجد في طلبكن، فإن نحن أخذنا في الفضاء لم يخف عليه أمرنا ولم يزل يتبعنا وإن نحن توجهنا إلى العمران خفي عليه أمرنا، وانصرف. وبمكان كذا جرذٌ هو لي أخ؛ فلو انتهينا إليه قطع عنا هذا الشرك. ففعلن ذلك. وأيس الصياد منهن وانصرف. وتبعهن الغراب. فلما انتهت الحمامة المطوقة إلى الجرذ، أمرت الحمام أن يسقطن، فوقعن؛ وكان للجرذ مائة حجر للمخاوف فنادته المطوقة باسمه، وكان اسمه زيرك، فأجابها الجرذ من حجره: من أنت؟ قالت: أنا خليلتك المطوقة. فأقبل إليها الجرذ يسعى، فقال لها: ما أوقعك في هذه الورطة؟ قالت له: ألم تعلم أنه ليس من الخير والشر شيء إلا هو مقدرٌ على من تصيبه المقادير، وهي التي أوقعتني في هذه الورطة؛ فقد لا يمتنع من القدر من هو أقوى مني وأعظم أمراً؛ وقد تنكسف الشمس والقمر إذا قضي ذلك عليهما. ثم إن الجرذ أخذ في قرض العقد الذي فيه المطوقة. فقالت له المطوقة: ابدأ بقطع عقد سائر الحمام، وبعد ذلك أقبل على عقدي؛ وأعادت ذلك عليه مراراً، وهو لا يلتفت إلى قولها، فلما أكثرت عليه القول وكررت، قال لها: لقد كررت القول عليّ كأنك ليس لك في نفسك حاجة، ولا لك عليها شفقة، ولا ترعين لها حقاً. قالت: إني أخاف، إن أنت بدأت بقطع عقدي أن تمل وتكسل عن قطع ما بقي؛ وعرفت أنك إن بدأت بهن قبلي، وكنت أنا الأخيرة لم ترضَ وإن أدركك الفتور أن أبقى في الشرك قال الجرذ: هذا مما يزيد الرغبة والمودة فيك. ثم إن الجرذ أخذ في قرض الشبكة حتى فرغ منها، فانطلقت المطوقة وحمامها معها.فلما رأى الغراب صنع الجرذ، رغب في مصادقته، فجاء وناداه باسمه، فأخرج الجرذ رأسه، فقال له: ما حاجتك؟ قال: إني أريد مصادقتك. قال الجرذ: ليس بيني وبينك تواصل، وإنما العاقل ينبغي له أن يلتمس ما يجد إليه سبيلاً، ويترك التماس ما ليس إليه سبيلٌ، فإنما أنت الآكل، وأنا طعام لك. قال الغراب: إن أكلي إياك، وإن كنت لي طعاماً، مما لا يغني عني شيئاً؛ وإن مودتك آنس لي مما ذكرت ولست بحقيق، إذا جئت أطلب مودتك، أن تردني خائباً. فإنه قد ظهر لي منك من حسن الخلق ما رغبني فيك، وإن لم تكن تلتمس إظهار ذلك: فإن العاقل لا يخفي فضله، وإن هو أخفاه؛ كالمسك الذي يكتم ثم لا يمنعه ذلك من النشر الطيب والأرج الفائح. قال الجرذ. إن أشد العداوة عداوة الجوهر: وهي عداوتان: منها ما هو متكافئ كعداوة الفيل والأسد. فإنه ربما قتل الأسد الفيل أو الفيل الأسد، ومنها ما قوَّته من أحد الجانبين على الآخر كعداوة ما بيني وبين السنور وبيني وبينك: فإن العداوة التي بيننا ليست تضرك، وإنما ضررها عائد عليَّ: فإن الماء لو أطيل إسخانه لم يمنعه ذلك من إطفائه النار إذا صب عليها، وإنما مصاحب العدوّ ومصالحه كصاحب الحية يحملها في كمه، والعاقل لا يستأنس إلى العدو الأريب...

source: <b "font-size:12pt;">Do you want to save the changes you made in the doc "Untitled"?</b>
ar: <b"font-size:12pt;">هل تريد حفظ التغييرات التي أدخلتها على الوثيقة "بلا عنوان"؟</b>

source: Your changes will be lost if you don't save them.
ar: سيتم فقدان التغييرات إذا لم تقم بحفظها.

source: Don't save
ar: لا تقم بالحفظ

source: Save...
ar: حفظ...

source: Scroll Up
ar: انتقل إلى أعلى

source: Scroll Down
ar: انتقل إلى أسفل

source: Scroll Left
ar: انتقل إلى اليسار

source: Scroll Right
ar: انتقل إلى اليمين

source: Scroll to 40, 100
ar: انتقل إلى 40، 100

source: Base effects
ar: تأثيرات أساسية

source: Attention effects
ar: تأثيرات الاهتمام

source: Vanish effects
ar: تأثيرات التلاشي

source: Toggle Opacity
ar: تبديل التعتيم

source: Toggle Size
ar: تبديل الحجم

source: Toggle Position
ar: تبديل الموضع

source: Toggle Background
ar: تبديل الخلفية

source: Shake
ar: هزة

source: ColorFlow
ar: انسياب الألوان

source: Pulsate
ar: خفق

source: Puff
ar: نفخة

source: Drop out
ar: ترك

source: Switch Off
ar: إيقاف

source: Shrink
ar: انكماش

source: Fold in
ar: إدراج

source: Drop in
ar: تراجع

source: Fold out
ar: كشف

source: sinodial transition will accelerate sinusoidal.
ar: تحول sinodial سوف يسرع الجيبية.

source: Alternates rapidly between start end target. Looks only nice on color effects.
ar: .مناوبة بسرعة بين البداية و النهاية . تبدو لطيفة فقط على تأثيرات الألوان

source: Alternates between start and end. Looks only nice on color effects.
ar: مناوبة بين البداية و النهاية . تبدو لطيفة فقط على تأثيرات الألوان

source: <span style="color:white;">Welcome to <br><b style="color:#F3FFB3;">qooxdoo</b> animations!</span>
ar: <span style="color:white;">مرحبا بكم في <br><b style="color:#F3FFB3;">كوكسدو</b> مأثرات!</span>

source: Linear is the default transition for many effects.
ar: .الانتقال الطولي هو الإختيار الافتراضي لعديد المأثرات

source: EaseInQuad will accelerate exponentially.
ar: .سوف تسرع أضعافا مضاعفة EaseInQuad

source: EaseOutQuad will slow down exponentially.
ar: .سوف تبطئ أضعافا مضاعفة EaseOutQuad

source: Sinodial transition will accelerate sinusoidal.
ar: .سوف يسرع المنحنى Sinodial التحول

source: Reverse behaves like linear, but in the opposite direction.
ar: .مثل الخطي، ولكن في الاتجاه المعاكس Reverse

source: Wobble will bounce the element forwards and backwards.
ar: .يرتد العنصر إلى الأمام وإلى الوراء Wobble

source: Spring will overshoot the target and then move back.
ar: . يتجاوز الهدف ومن ثم ينتقل الى الوراء Spring

source: Show it!
ar: !أظهره

source: Description
ar: وصف

source: Duration
ar: المدة

source: Junk #
ar: # غير هام

source: Data 123213234325345234523453453245
ar: بيانات 123213234325345234523453453245

source: New tree item name:
ar: :اسم جديد لعنصر الشجرة

source: Hello
ar: مرحبا

source: Add folder
ar: إضافة مجلد

source: Add file
ar: إضافة ملف

source: Add after
ar: إضافة بعد

source: Add before
ar: إضافة قبل

source: Add at begin
ar: إضافة في البدء

source: Remove tree item
ar: إزالة عنصر الشجرة

source: Remove all children
ar: إزالة جميع الفروع

source: Move to parent
ar: حرك او انقل الأب

source: Show open button:
ar: أظهر الزر المفتوح

source: always
ar: دائما

source: never
ar: أبدا

source: auto
ar: تلقائي

source: Reset tree
ar: إعادة ضبط الشجرة

source: Checkbox #1
ar: خانة الاختيار #1

source: It seems that your browser doesn't support HTML5 audio
ar: HTML5 Audio يبدو أن متصفحك لا يعالج

source: Block Document for 5s
ar: تعطيل الوثيقة ل 5 ثواني

source: Block Element for 5s
ar: تعطيل العنصر ل 5 ثواني

source: Restore
ar: استعادة

source: Delete
ar: حذف

source: : Box=
ar: : مربع =

source: ; Content=
ar: ؛ محتوى =

source: Block
ar: كتلة

source: <h2>Synchronous checks</h2>
ar: <h2>تثبتات متزامنة</h2>

source: <tr><td colspan='2'><h2>Asynchronous checks</h2></td></tr>
ar: <tr><td colspan='2'><h2>تثبتات غير متزامنة </h2></td></tr>

source: Finding Your Location...
ar: العثور على موقعك...

source: Geolocation Not Supported
ar: تحديد الموقع الجغرافي غير معتمد

source: Permission Denied
ar: الإذن مرفوض

source: Position Unavailable
ar: موضع غير متوفر

source: Timeout
ar: إنتهت المهلة

source: Failed: %1
ar: فشل : ٪ 1

source: <h1>HtmlArea low-level widget</h1><p>This low-level widget can be used separately at traditional web pages / single-page applications.<br/> It is the foundation for the UI widget component.</p><p style='margin-bottom:10px'><b>No UI-level code</b> is included in this demo.You can play around with this widget by hitting the buttons at the toolbar.</p>
ar: <h1>تطبيق مصغر هتمل على مستوى منخفض</h1><p>.ويمكن استخدام هذه القطعة على مستوى منخفض بشكل منفصل في صفحات الويب التقليدية / التطبيقات ذات الصفحة الواحدة<br/>.وهو الأساس لمكون واجهة التطبيق المصغر</p><p style='margin-bottom:10px'><b>لا يوجد أي كود واجهة المستخدم </b>تم تضمينها في هذا العرض.يمكنك تشغيل هذا التطبيق من خلال ضرب الأزرار في شريط الأدوات.</p>

source: FontSize:
ar: :حجم الخط

source: <td>First Row, First cell</td>
ar: <td>أول صف، الخلية الأولى</td>

source: <td>First Row, Second cell</td>
ar: <td>أول صف، الخلية الثانية</td>

source: <td>Second Row, First cell</td>
ar: <td>الصف الثاني، الخلية الأولى</td>

source: <td>Second Row, Second cell</td>
ar: <td>الصف الثاني، الخلية الثانية</td>

source: Link:
ar: الرابط :

source: Change font family
ar: تغيير عائلة الخط

source: Change font size
ar: تغيير حجم الخط

source: testFrame
ar: إطار الاختبار

source: Value %1
ar: %1 القيمة

source: Quite a long label text
ar: .نص التسمية طويل جدا

source: This is <b>bold</b> text
ar: <b> غامق </b> هذا النص

source: hello world
ar: مرحبا بالعالم

source: foo bar
ar: شريط فو

source: hello <b>world</b>
ar: <b>بالعالم</b> مرحبا

source: foo <i>bar</i>
ar: فو <i>شريط </i>

source: test test2 test3 test4 test5 test6
ar: اختبار اختبار2 اختبار3 اختبار4 اختبار5 اختبار6

source: <strong>Results</strong>
ar: <strong>النتائج</strong>

source: this is a test
ar: هذا اختبار

source: Click to follow the link
ar: انقر لاتباع الرابط

source: <li>inserted via append()</li>
ar: <li> append() تم إدراجها عبر</li>

source: <li>inserted via prepend()</li>
ar: <li> append() تم إدراجها عبر</li>

source: <li>inserted via after()</li>
ar: <li> append() تم إدراجها عبر</li>

source: <li>inserted via before()</li>
ar: <li> append() تم إدراجها عبر</li>

source: <option>Dr</option>
ar: <option>.د</option>

source: <option>Mr</option>
ar: <option>السيد</option>

source: <option>Mrs</option>
ar: <option>السيدة</option>

source: <option>Prof</option>
ar: <option>بروفيسور</option>

source: <h3>Dynamically Inserted H3</h3>
ar: <h3> H3 تم إدراج ديناميكيا </h3>

source: It seems that your browser doesn't support HTML5 video
ar: HTML5 video يبدو أن متصفحك لا يعالج

source: Play/Pause
ar: تشغيل / إيقاف مؤقت

source: Native Controls
ar: العناصر الأم

source: Mute
ar: صامت

source: Loop
ar: حلقة

source: key
ar: مفتاح

source: Clear
ar: واضح

source: Remove
ar: إزالة

source: Calculate Fibonacci Numbers in a Web Worker
ar: .يقوم بحساب أرقام فيبوناتشي في عامل على شبكة الإنترنت. أدخل رقما وانقر على زر حساب

source: Calculate
ar: أحسب

source: Your browser supports Web Workers
ar: المتصفح يدعم عمال الويب

source: Your browser doesn't support Web Workers
ar: متصفحك لا يدعم عمال الويب

source: Calculating...
ar: ...حساب

source: Open Native Window
ar: افتح نافذة أم

source: window1
ar: نافذة 1

source: Window closed?
ar: نافذة مغلقة؟

source: Open Native Modal Window
ar: افتح نافذة أم مشروطة

source: window2
ar: نافذة 2

source: Modal Window closed?
ar: نافذة مشروطة مغلقة؟

source: Open Faked Native Modal Window
ar: افتح نافذة أم مشروطة مزيفة

source: window3
ar: نافذة 3

source: Online <> Offline
ar: متصل<> غير متصل

source: <b>Displaying Checkboxes in a list</b><br/>This list display a set of persons in a list as checkbox. Every person does have a name as label and an online status as checkbox.
ar: <b>عرض خانات اختيار في قائمة</b><br/>.تعرض هذه القائمة مجموعة من الأشخاص في القائمة كخانة اختيار. كل شخص لديه اسم كتسمية وحالة اتصال بالإنترنت كخانة اختيار

source: all boring black
ar: كل الأسود الممل

source: <b>A tree configures with bindItem</b><br/>The tree has bound its label to the name of the modeln and its textColor to some random colors.
ar: <b>شجرة تم تهيئتها باستخدام ربط البند</b><br/>.لقد ربطت تسمية الشجرة إلى اسم النموذج و لون النص إلى بعض الألوان العشوائية

source: Finder
ar: الباحث

source: qooxdoo
ar: كوكسدو

source: loading
ar: تحميل

source: Name:
ar: الاسم :

source: Gender:
ar: الجنس :

source: -please select-
ar: - يرجى الإختيار -

source: male
ar: ذكر

source: female
ar: أنثى

source: Ok:
ar: موافق :

source: You are sending: %1
ar: تقوم بإرسال : 1 ٪

source: dont know!
ar: لا أعلم!

source: Alien
ar: غريب

source: Firstname
ar: الإسم

source: Lastname
ar: اللقب

source: Gender
ar: الجنس

source: Show model data in the log
ar: إظهار بيانات النموذج في السجل

source: Simple Form
ar: نموذج بسيط

source: First Name
ar: الإسم

source: Last Name
ar: اللقب

source: Company
ar: الشركة

source: Email
ar: البريد الإلكتروني

source: Date
ar: التاريخ

source: Cancel
ar: تجاهل

source: You are saving: %1
ar: تقوم بحفظ : ٪ 1

source: <b>List bound to data in a json file</b><br/>Loading the json file <a href='%1' target='_blank'>list.json</a> and bind the items to the list widget. The icons will be created by a converter which converts the type to an icon url.
ar: <b>JSON قائمة مرتبطة بالبيانات في ملف</b><br/><a href='%1' target='_blank'>persons.json JSON تحميل الملف </a> .وربط العناصر إلى القائمة. سيتم إنشاء الأيقونات بواسطة المحول الذي يحول النوع إلى أيقونة رابط

source: <b>Tree bound to data in a json file</b><br/>Loading the json file <a href='%1' target='_blank'>tree.json</a> and bind the items to the tree widget.
ar: <b>JSON شجرة مرتبطة بالبيانات في ملف</b><br/><a href='%1' target='_blank'>tree.json JSON تحميل الملف </a> .وربط العناصر إلى الشجرة

source: Item %1
ar: عنصر

source: Add an item
ar: أضف عنصر

source: Remove an item
ar: إلغي عنصر

source: Write data to log
ar: .كتابة البيانات إلى المسجل

source: <b>Multi selection List</b><br/>Bound to the same data and share the selection.
ar: <B>قائمة اختيار متعددة </ B> <BR/>منضمة إلى نفس البيانات والمشاركة في الاختيار.

source: <b>Selection List</b><br/>Bound to the selection of the list to the left.
ar: <B>قائمة اختيار </ B> <BR/>منضمة الى اختيار القائمة إلى اليسار.

source: <b>Selection Label</b><br/>Bound to the selection of the list to the left.
ar: <b>تسمية للإاختيار</b><br/>.مرتبطة بالإاختيار في القائمة على اليسار

source: <b>List</b><br/>
ar: <b>قائمة</b><br/>

source: <b>SelectBox</b>
ar: <b>الاختيارات صندوق</b>

source: <b>ComboBox</b><br/>
ar: <b>مربع تحرير وسرد</b><br/>

source: All 3 widgets share the same data model. The List and the SelectBox also share the same selection.
ar: .التطبيقات المصغرة الثلاث تشترك فى نفس نموذج البيانات. القائمة و مربع الإختيار تشترك أيضا في نفس الإختيار

source: init
ar: استهل

source: Show only even numbers.
ar: أظهر الأعداد الزوجية فقط

source: Show only odd numbers.
ar: أظهر الأعداد الفردية فقط

source: Show all numbers.
ar: أظهر كل الأعداد

source: Odd / Even filter
ar: مصفي فردي/زوجي

source: Remove filter
ar: إلغاء التصفية

source: Reverse order
ar: ترتيب عكسي

source: <b>Filtered List</b><br/>List showing numbered items, bound to a data array.
ar: <B>قائمة تمت تصفيتها </ ب> القائمة <BR/>إظهار العناصر المرقمة، منضما إلى مصفوفة البيانات.

source: Make all happy
ar: جعل الجميع سعداء

source: <b>Displaying objects in a list</b><br/>This list display a set of persons in a list. Every person does have a name and an emotion, which is displayed with the help of a converter by the icon. The font color shows the online status.
ar: <b>عرض الكائنات في قائمة</b><br/>.تعرض هذه القائمة مجموعة من الأشخاص في القائمة. كل شخص لديه اسم و حالة انفعال.لون الخط يوضح حالة الإتصال بالانترنت.

source: <b>Debugging models</b><br/>Every model created by the data stores consists only of qooxdoo objects with properties. To see the properties, you can use the debugModel function in qx.dev.Debug.
ar: <b>نماذج التصحيح</b><br/>كل نموذج أنشأتها مخازن البيانات يتكون فقط من الكائنات qooxdoo مع الخصائص. لمشاهدة الخصائص، يمكنك استخدام وظيفة في debugModel qx.dev.Debug.

source: no model...
ar: ...لا يوجد نموذج

source: <b>List bound to data in a json file</b><br/>Loading the json file <a href='%1' target='_blank'>persons.json</a> and bind the items to the list widget. In the converter for the label, the names will be set to both, the first and last name.
ar: <b>JSON قائمة مرتبطة بالبيانات في ملف</b><br/><a href='%1' target='_blank'>persons.json JSON تحميل الملف </a> .وربط العناصر إلى القائمة. في المحول للتسمية، سيتم تعيين الأسماء لكل من الاسم الأول والأخير

source: Sort By Type
ar: ترتيب حسب النوع

source: Sort By Name
ar: ترتيب حسب الاسم

source: <b>Adding own code to the model</b><br/>Using the delegation to bring two sort function to the root model class of this demo. The buttons just calling those sort functions.
ar: <b>إضافة كود خاص لهذا النموذج</b><br/>استخدام الوفد لجلب اثنين من دالة الفرز

source: <b>Search As You Type List</b><br/>Type a name and the list will show only the matching results (case-sensitive).
ar: <b>قائمة البحث أثناء الكتابة</b><br/>.اكتب اسما والقائمة سوف تظهر فقط نتائج البحث :حساسة لحالة الأحرف

source: The selection is:
ar: الاختيار هو

source: Set Selection to 'C'
ar: 'تعيين التحديد إلى'ج

source: <b>Synchronized Selection</b><br/>Bound to the same data and share the selection. The label is also bound to the selection.
ar: <b>مختارات متزامنة</b><br/>.مرتبطة بنفس البيانات وتبادلها التحديد.التسمية أيضا مرتبطة بالتحديد

source: <b>Change Selection</b><br/>Type in the textfield or set the selection with the button.
ar: <b>تغيير الاختيار</b><br/>.اكتب في حقل النص أو استخدم الزر لإجراء الاختيار

source: Event binding
ar: ربط الحدث

source: Change me...
ar: غيرني او بدلني

source: With default conversion
ar: مع التحويل الافتراضي

source: With own conversion
ar: مع تحويلي

source: Lower than 50!
ar: أقل من 50

source: Bigger than 50!
ar: أكثر من 50

source: Array binding
ar: ربط مجموعة

source: Reverse
ar: اعكس أو عكس

source: Toggle child
ar: الطفل البديل

source: First:
ar: الأول

source: Last:
ar: الأخير

source: With validation
ar: عملية التحقق

source: No number!
ar: لا يوجد رقم

source: <b>Description</b><br/>Binding an data event, containing the change of the textfield to the label.
ar: <b>وصف</b><br/>. ربط حدث البيانات, الذي يتضمن تغييرا في خانة النص إلى التسمية

source: <b>Description</b><br/>Binding a number value (slider value) to a labels string (content). The default conversion will handle the type conversion.
ar: <b>وصف</b><br/>. ربط قيمة رقمية (قيمة شريط التمرير) إلى جملة تسميات (المحتوى). سيقوم التحويل الافتراضي بمعالجة نوع التحويل

source: <b>Description</b><br/>Binding a slider value to a labels text but conversion the number with a self written converter to a string only saying it its above or below 50.
ar: <b>وصف</b><br/>. ربط قيمة شريط التمرير إلى نص التسميات ولكن تحويل الرقم مع المحول الذاتي إلى جملة مكتفيا بالقول انها أعلى، أو دون 50

source: <b>Description</b><br/>Binding of node elements containing a node as child and an array of names.<br/>The reverse button reverses the current selected child names array.<br/>Toggle child will change the child of the root node from a node containing ['Homer', 'Marge'] as names to a node containing ['Bart', 'Lisa'] as names.
ar: <b>وصف</b><br/>. ربط عناصر العقدة التي تحتوي على عقدة وطفل ومجموعة من الأسماء .الزر عكس يعكس مجموعة أسماء الأطفال المختارة.تبديل الطفل سيغير طفل العقدة الجذر من عقدة تحتوي على ['هوميروس '،' زبدة نباتية '] كأسماء إلى عقدة تحتوي على [' بارت '،' ليزا '] كأسماء.

source: <b>Description</b><br/>Binding the textfield to a property with a validation. The validator in the object only accepts numbers. On a validation fail, a red border will surround the textfield.
ar: <b>وصف</b><br/>. ربط حقل النص إلى خاصية مع التحقق من الصحة. المدقق في الكائن يقبل أرقام فقط. إذا فشل التحقق، فإن حدود حمراء تحيط حقل النص

source: Thing %1
ar: %1 شيء

source: Add an item to root
ar: إضافة عنصر إلى الجذر

source: Remove an item from root
ar: إزالة عنصر من الجذر
