Repository: rnapoles/trunk-qooxdoo-contrib-code
Catalog: trunk/qooxdoo-contrib/qooxdoo-rtl/trunk/translation/*.po
Languages: ar

source: Change the label binding
ar: تغيير ربط التسمية

source: This tree is bound to a set of randomly generated nodes. Every node does have a name and a name2 property, containing 'Item i' and 'Thing i'.
ar: .هذه الشجرة متصلة بمجموعة من العقد تم إنشاؤها بشكل عشوائي

source: <b>Selected Items</b><br/>A list containing the selected items of the tree.
ar: <b>عناصر مختارة</b><br/>.قائمة تحتوي على العناصر المختارة من الشجرة

source: May
ar: مايو

source: maxHeight=300
ar: اقصى ارتفاع=300

source: minWidth=400
ar: ادنى عرض=400

source: Flow Layout
ar: تدفق تصميم

source: item #%1
ar: %1# البند رقم

source: Flow Layout with line breaks
ar: تدفق تصميم مع فواصل الأسطر

source: 1. First Button
ar: أول زر .1

source: 2. Second longer Button...
ar: ...الثاني زر أطول .2

source: 3rd really, really, really long Button
ar: حقا، حقا ، حقا زر طويلة3

source: Number 4
ar: عدد 4

source: 20px Margins around the great big 5th button!
ar: px20 هوامش حول الزر الكبير 5 الكبيرة!

source: Number 6
ar: عدد 6

source: 7th a wide, short button
ar: مجموعة واسعة 7، زر قصيرة

source: click me
ar: انقر فوقي

source: click to reverse
ar: انقر لعكس

source: <b>Use your fingers to move the dots</b>
ar: <b>استخدام أصابعك لتحريك النقاط </ B>

source: <b>This demo is supposed to be run in a WebKit-based browser on a touch-enabled device.</b>
ar: <b> على جهاز يعمل باللمس WebKit يفترض أن يتم تشغيل هذا العرض في متصفح مبني على</b>

source: row %1, col %2
ar: ٪ الصف 1، العمود 2 ٪

source: <span style='color:red;'>Last item is intentionally inserted at the top to show how it's done</span>
ar: <span style='color:red;'>يتم إدراج البند الأخير عن قصد في الجزء العلوي لإظهار كيفية القيام بذلك</span>

source: Number 1
ar: رقم 1

source: Number 2
ar: رقم 2

source: Html
ar: لغة تأشير النص الفائق

source: Literal
ar: حرفي3

source: Hello world!
ar: مرحبا بالعالم

source: I'm red!
ar: !أنا أحمر

source: Number
ar: عدد

source: Id
ar: معرف

source: Move your mouse over the Date field
ar: حرك مؤشر الفأرة فوق حقل التاريخ

source: Note variable row heights in this table.
ar: لاحظ متغير ارتفاع الصفوف في هذا الجدول.

source: I am small.
ar: .أنا صغير

source: I am tall.
ar: .انا طويل

source: This, too, is small.
ar: .هذا، أيضا، صغير

source: This, too, is tall.
ar: .هذا، أيضا، طويل

source: No attributes specified.
ar: لا توجد خصائص محددة.

source: Add window
ar: إضافة نافذة

source: Window #%1
ar: نافذة # 1 ٪

source: Add modal window
ar: إضافة نافذة مشروطة

source: Modal Window #%1
ar: نافذة مشروطة # %1

source: Web Browser
ar: متصفح ويب

source: This feature is currently not supported.
ar: هذه الخاصية غير مدعومة حالياً

source: Del
ar: حذف

source: You can't divide by 0!
ar: لا يمكنك القسمة على 0!

source: Page
ar: صفحة

source: City
ar: المدينة

source: New York
ar: نيويورك

source: USA
ar: الولايات المتحدة الأمريكية

source: Sex
ar: الجنس

source: Hobbies
ar: هواياتك

source: Reading
ar: القراءة

source: Swimming
ar: السباحة

source: Form Elements
ar: عناصر الفورم أو الشكل

source: Choose a locale:
ar: اختر اللغة :

source: Localized ComboBox:
ar: مربع تحرير وسرد محلي :

source: A date:
ar: :تاريخ

source: Select All
ar: اختر الكل

source: Search Again
ar: ابحث ثانية

source: Command Menu (keyboard shortcuts)
ar: قائمة الأمر (اختصارات لوحة المفاتيح)

source: Open Color Popup
ar: افتح اللون المنبثق

source: Colors
ar: الالوان

source: Locale Information
ar: المحلية المعلومات

source: Locale information
ar: المحلية المعلومات

source: Locale:
ar: محلي

source: Territory code:
ar: : رمز الإقليم

source: Date format short:
ar: تنسيق التاريخ القصير ​​:

source: Date short:
ar: التاريخ القصير ​​:

source: Date format medium:
ar: تنسيق التاريخ المتوسط ​​:

source: Date medium:
ar: تاريخ متوسط

source: Date format long:
ar: تنسيق التاريخ الطويل.​​:

source: Date long:
ar: التاريخ الطويل ​​:

source: Date format full:
ar: تنسيق التاريخ الكامل :

source: Date full:
ar: التاريخ الكامل :

source: Time format short:
ar: تنسيق الوقت القصير ​​:

source: Time short:
ar: الوقت القصير:

source: Time format long:
ar: تنسيق الوقت الطويل ​​:

source: Time long:
ar: الوقت الطويل ​​:

source: Week start:
ar: بداية الأسبوع :

source: Format of %1:
ar: صيغة 1 ٪ :

source: Yahoo Maps
ar: خرائط ياهو

source: Google Maps
ar: خرائط جوجل

source: <b>Locale and language:</b>
ar: <b>:المكان واللغة </b>

source: Choose Locale:
ar: اختيار اللغة :

source: Locale
ar: اللغة

source: Territory
ar: إقليم

source: Language
ar: لغة

source: Locale: %1
ar: اللغة : %1

source: Territory: %1
ar: الإقليم : 1 ٪

source: Language: %1
ar: اللغة : ٪ 1

source: Add translation<br>at runtime for: <b>%1</b>
ar: <b>%1</b> : في وقت التشغيل من أجل <br> إضافة الترجمة

source: Hello World
ar: مرحبا بالعالم

source: Simple Translate: this.tr('Hello World')
ar: ترجمة بسيطة : this.tr ("مرحبا بالعالم")

source: I have an apple
ar: لدي تفاحة

source: Singular/Plural Translate: this.trn('I have an apple', I have %1 apples, %1, applesNumber
ar: مفرد / جمع الترجمة : this.trn(لدي تفاحة' , لدي %1 تفاحات, %1' ,applesNumber

source: The quick brown fox
ar: الثعلب البني السريع

source: with .po comment: this.trc('The mammal fox that is.', 'The quick brown fox')
ar: تعليق .po : this.trc('.وأن الثعلب من الثدييات', 'الثعلب البني السريع')

source: Orange
ar: برتقال

source: Mark the string 'Orange' for later translation so we do not forget it: this.marktr('Orange')
ar: this.marktr ('لتمييز للترجمة في وقت لاحق حتى لا ننسى ذلك ('البرتقالية

source: <b>Static translation [found in .po files]. Hover the labels below to see more info.</b>
ar: <b>.ترجمة ثابتة [لقد وجد في ملفات بو.]. تحوم التسميات أدناه لمعرفة المزيد من المعلومات</b>

source: <i>Translated Text</i>
ar: <I>ترجمة النص </ I>

source: Simple messageId translation
ar: messageId ترجمة بسيطة ل

source: Number of apples:
ar: عدد من التفاح:

source: Number of apples
ar: عدد من التفاح

source: Singular/Plural Translate<br>Choose a number from the select box<br>to see plural translation
ar: لمعرفة ترجمة الجمع<br>اختر عددا من مربع الإختيار<br> ترجمة المفرد / الجمع

source: A comment: 'The mammal fox that is.'<br>is added in the .po file
ar: .po يضاف في ملف <br>تعليق : 'وأن الثعلب من الثدييات'

source: Mark the string 'Orange' for later<br>translation so we do not forget it
ar: لتمييز "البرتقالية" للترجمة في وقت لاحق <br> حتى لا ننسى

source: <b>Dynamic translation. This is added at runtime.</b>
ar: <b>.ديناميكية الترجمة. يضاف هذا في وقت التشغيل</b>

source: MessageId
ar: رقم تعريف الرسالة

source: Translation
ar: ترجمة

source: Add Translation
ar: اضف ترجمة

source: %1 has been added for messageId: %2 for locale: %3
ar: للغة : %3 messageId %1أضيف لل %2

source: MessageId:
ar: رقم تعريف الرسالة:

source: show Translation
ar: اظهر الترجمة

source: click 'Show Translation' button to translate<br>the messageId in the current selected locale
ar: '" انقر فوق الزر "اظهر الترجمة" لترجمة رقم تعريف الرسالة في المكان الحالي المختار<BR>

source: Add new Locale<br> at runtime
ar: إضافة جديد محلي في وقت التشغيل <BR>

source: Locale Name (ex: en_QX)
ar: ( en_QX :اسم اللغة (مثال

source: Add new Locale
ar: إضافة لغة جديدة

source: new Locale must not be empty string
ar: يجب أن لا تكون اللغة الجديدة سلسلة أحرف فارغة

source: %1 already exists
ar: ٪ 1 موجود مسبقا

source: %1 has been added
ar: تمت إضافة ٪ 1

source: Column #%1
ar: عمود #%1

source: Cell %1x%2
ar: خلية %1x%2

source: Text
ar: نص

source: Hello %1 Generated on:%2
ar: مرحبا %1 إنشاؤها في: %2

source: Property editor table
ar: جدول خاصية المحرر

source: User Name
ar: اسم المستخدم

source: secret
ar: سري

source: Role
ar: صلاحية

source: editable combobox
ar: مربع تحرير وسرد قابل للتحرير

source: admin
ar: مشرف

source: manager
ar: مدير

source: user
ar: مستخدم

source: Status
ar: حالة

source: Inactive
ar: غير فعال

source: Active
ar: نشط

source: Waiting
ar: انتظار

source: enter valid email
ar: أدخل بريد إلكتروني صالح

source: Telephone
ar: هاتف

source: enter valid telephone number
ar: أدخل رقم هاتف صالح

source: Use only numbers!
ar: استخدم الأرقام فقط!

source: Website
ar: موقع

source: enter website
ar: أدخل الموقع

source: Newsletter
ar: النشرة الإخبارية

source: You did not enter a valid email address
ar: لم تقم بإدخال عنوان بريد إلكتروني صالح

source: You need to supply a value here
ar: تحتاج إلى توفير القيمة هنا

source: Property
ar: خاصية

source: Doubleclick on cell to edit value
ar: انقر مرتين على الخلبة لتحرير القيمة

source: Table using conditional cell renderer
ar: جدول يتضمن عارض الخلية الشرطية

source: Image
ar: صورة

source: Default ctx menu #1
ar: #1 الافتراضية ctx قائمة

source: Default ctx menu #2
ar: #2 الافتراضية ctx قائمة

source: Disabled ctx menu
ar: معطلة ctx قائمة

source: Context-menu selectable
ar: سياق اختيار القائمة

source: On
ar: تشغيل او مفتوح

source: Off
ar: إيقاف

source: Change row with ID 10
ar: تغيير الصف بالمعرف 10

source: Change ID sort method
ar: تغيير معرف طريقة الترتيب

source: Demonstrate use of alternate sorting algorithm.
ar: .شرح استخدام آخر لخوارزمية الترتيب

source: Event log
ar: سجل الأحداث

source: Column
ar: عمود

source: Row
ar: صف

source: Capture events
ar: التقاط الأحداث

source: Table with data filtering
ar: جدول يتضمن البيانات المصفية

source: , additional Status.
ar: .حالة إضافية

source: Hide True
ar: True إخفاء

source: , additional Status. True Values are hidden.
ar: .True حالة إضافية. يتم إخفاء المعطيات

source: Hide False
ar: False إخفاء

source: , additional Status. False Values are hidden.
ar: .False حالة إضافية. يتم إخفاء المعطيات

source: Hide 1k-5k
ar: 1k-5k إخفاء

source: , additional Status. 1k - 5k Values are hidden.
ar: .1k - 5k حالة إضافية. يتم إخفاء المعطيات

source: Show All
ar: اظهر الكل

source: , additional Status. All Values are shown.
ar: .حالة إضافية. تظهر جميع المعطيات

source: Column %1
ar: عمود %1

source: Table with meta columns
ar: جدول مع الأعمدة الوصفية

source: Reload
ar: إعادة تحميل

source: Table with automatic column sizes
ar: جدول مع أحجام تلقائية للعمود

source: Boolean test
ar: اختبار منطقي

source: Add 10 rows
ar: اضف 10 صفوف

source: Remove 10 rows
ar: الغي 10 صفوف

source: Keep first row
ar: ابقي الصف الأول

source: Whether the the first visible row should be rendered completely when scrolling.
ar: .ما إذا كان ينبغي أن يصدر تماما في الصف الأول المرئي عند التنقل

source: Table
ar: جدول

source: Boolean
ar: منطقي

source: Add 5 rows
ar: اضف 5 صفوف

source: Remove 5 rows
ar: الغي 5 صفوف

source: Reset Selection
ar: إعادة الاختيار

source: Reset Cell Focus
ar: إعادة تركيز الخلية

source: Hide Cell Focus
ar: إخفاء تركيز الخلية

source: Show selection
ar: إظهار الاختيار

source: Selected rows:<br>%1
ar: %1 <br> اختيار الصفوف :

source: Table with window cell editor
ar: جدول يتضمن إطار محرر الخلية

source: A boolean
ar: منطقي

source: ID
ar: معرف

source: A number
ar: رقم

source: A date
ar: تاريخ

source: Cell Editor
ar: محرر الخلية

source: Enter
ar: إدخال

source: Horizontal box layout:
ar: مربع التخطيط الأفقي

source: Grid layout:
ar: : الشبكة تخطيط

source: Remove %1
ar: إزالة

source: Add %1
ar: إضافة

source: HBox/VBox Decorator Demo
ar: HBox / VBox ديكور تجريبي

source: Label: %1
ar: عنوان : ٪ 1

source: Window:
ar: نافذة :

source: <b>hello</b>
ar: <b>مرحبا</b>

source: hello
ar: مرحبا

source: before2
ar: قبل 2

source: after2
ar: بعد 2

source: row%1
ar: صف %1

source: row%1col%2
ar: صف %1 عمود %2

source: I am a box
ar: box أنا

source: I am a label
ar: تسمية أنا

source: Button
ar: زر

source: Toggle Button
ar: زر تبديل

source: Repeat Button
ar: زر تكرار

source: Hover Button
ar: زر تحويم

source: File 1
ar: ملف 1

source: File 2
ar: ملف 2

source: File 3
ar: ملف 3

source: Is AlphaImageLoader enabled: %1
ar: مفعل: %1 AlphaImageLoader هل

source: Apply opacity on root
ar: تطبيق التعتيم على الجذر

source: Apply opacity on container
ar: تطبيق التعتيم على الحاوية

source: Toggle pane
ar: تبديل جزء

source: Toggle content
ar: تبديل المحتوى

source: Auto
ar: تلقائي

source: Content size: 300x300
ar: حجم المحتوى : 300x300

source: Toggle size
ar: تبديل الحجم

source: Long list
ar: قائمة طويلة

source: Fonts
ar: طقم الحروف

source: Font %1
ar: طقم الحروف %1

source: Long button, short text
ar: الزر طويل، والنص قصير

source: Welcome to <br><b style="color:#F3FFB3;">qooxdoo</b> animations!
ar: مرحبا بكم في الرسوم المتحركة <br><b style="color:#F3FFB3;">qooxdoo.</b>

source: Get value
ar: احصل على قيمة

source: Add/Remove editor
ar: إضافة / إزالة المحرر

source: cat
ar: قط

source: rat
ar: جرذ

source: dog
ar: كلب

source: mouse
ar: الفأرة

source: World
ar: العالم

source: <b>bold</b>
ar: <b>غامق </ b>

source: <i>italic</i>
ar: <i>مائل </ i>

source: multi<br>line
ar: خطوط <br> متعددة

source: Show move feedback
ar: عرض نقل التغذية المرتدة

source: Hide move feedback
ar: إخفاء تحرك ردود الفعل

source: Complete update
ar: تم إكمال التعديل

source: tool tip
ar: أداة تلميح

source: Start timers
ar: ابدأ المؤقتات

source: <b>Cancel Touch</b>
ar: <b>إلغاء اللمس</b>

source: Touch canceled
ar: إلغاء اللمسة

source: Type: %1
ar: نوع

source: Is Multi-Touch: %1
ar: %1: هل هو متعدد اللمس

source: All Touches: %1
ar: %1 :جميع اللمسات

source: Target Touches: %1
ar: %1 : اللمسات المستهدفة

source: Changed Target Touches: %1
ar: تغيير اللمسات المستهدفة : %1

source: Document: Left = %1 / Top = %2
ar: مستند : يسار = %1 / أعلى = %2

source: Screen: Left = %1 / Top = %2
ar: شاشة : يسار = %1 / أعلى = %2

source: Viewport: Left = %1 / Top = %2
ar: إطار العرض : يسار = %1 / أعلى = %2

source: Identifier: %1
ar: المعرف : ٪ 1

source: Are all touch targets div %1:%2
ar: %2:%1 DIV هل كل اللمسات المستهدفة

source: <b>Initial property values</b><br>name:%1<br>age:%2<br>gender:%3<br><br><b>Setting the name to 'Hans'</b><br>
ar: <b>قيم الخصائص الأولية</b> <br>%1 :الاسم<br>%2 :العمر<br>%3:الجنس<br><br><b>ضبط الاسم إلى صلاح </b><br>

source: new name: %1<br>
ar: %1: الاسم الجديد<br>

source: <b>Setting the name to ''</b><br>
ar: <b>'' ضبط الاسم إلى</b><br>

source: new name: <br>
ar: : الاسم الجديد<br>

source: <font color='red'>NAME NOT SET</font><br>old name: %1<br>
ar: <font color='red'>لم يتم تعيين الاسم</font><br>old name: %1<br>

source: <br><b>Setting the age property to 27</b><br>
ar: <br><b>تعيين خاصية العمر إلى 27</b><br>

source: new age: %1<br>
ar: %1 :عمر جديد <br>

source: <b>Setting the age property to 'true'</b><br>
ar: <b>'true' تعيين خاصية العمر إلى</b><br>

source: <font color='red'>AGE NOT SET</font><br>old age: %1<br>
ar: <font color='red'>لم يتم تعيين العمر</font><br>old age: %1<br>

source: <br><b>Setting the gender property to 'female'</b><br>
ar: <b> 'female' اختبار خاصية الجنس إلى</b><br>

source: new gender: %1<br>
ar: %1 : جنس جديد<br>

source: <b>Testing the gender property to 'fmale'</b><br>
ar: <b> 'fmale' اختبار خاصية الجنس إلى</b><br>

source: <font color='red'>GENDER NOT SET</font><br>old gender: %1<br>
ar: <font color='red'>الجنس غير محدد</font><br>old gender: %1<br>

source: <b>Description</b><br/>The demo creates an internal class containing three properties:<br/>- name: Name is validated to a minimum length of two.<br/>- age: Age is validated to be a number.<br/>- gender: Gender is validated to be either male or female.
ar: <br/>:العرض التجريبي يخلق طبقة داخلية تتضمن ثلاث خصائص<br/>.الاسم : التحقق من صحة الاسم حيث لا يقل طوله عن اثنين-<br/>.العمر : التحقق من صحة العمر حيث يجب أن يكون رقما-<br/>.الجنس : التحقق من صحة الجنس حيث يجب أن يكون ذكرا أو أنثى-<b>وصف</b>

source: My name
ar: اسمي

source: Configurable
ar: قابل للتكوين

source: Item No %1icon/%2/places/folder.png
ar: %1icon/%2/places/folder.png البند رقم

source: Single Selection
ar: اختيار واحد

source: Multi Selection
ar: اختيار متعدد

source: Additive Selection
ar: الاختيار المضاف

source: One Selection
ar: اختيار احادي

source: Enable quick selection
ar: إتاحة الاختيار السريع

source: One as selection mode
ar: واحد كوضع اختيار

source: Item No %1
ar: %1 البند رقم

source: Additive selection
ar: اختيار مضاف

source: Affe %1
ar: %1 قرد

source: Loading...
ar: تحميل...

source: Spam Message #
ar: الرسائل غير المرغوب فيها #

source: Tree
ar: شجرة

source: Desktop
ar: سطح المكتب

source: Files
ar: ملفات

source: Workspace
ar: منطقة العمل

source: Windows (C:)
ar: يندوز (C :)

source: Documents (D:)
ar: مستندات

source: Network
ar: شبكة

source: Trash
ar: قمامة

source: Inbox
ar: صندوق الوارد

source: Spam
ar: الرسائل غير المرغوب فيها

source: Spam Message #%1
ar: %1 رسائلة غير مرغوب فيها#

source: Sent
ar: إرسال

source: Data
ar: بيانات

source: Edit
ar: تحرير

source: Selected labels:
ar: :تسميات مختارة

source: Filter
ar: مصفي

source: Permissions
ar: صلاحيات

source: Last Accessed
ar: أخر وصول

source: Current Selection:
ar: الاختيار الحالي

source: Use tree lines if theme supports them?
ar: تستخدم خطوط شجرة إذا السمة تدعمها؟

source: Exclude first-level tree lines?
ar: استبعاد المستوى الأول من خطوط الشجرة؟

source: Always show open/close symbol?
ar: دائما اظهر الرمز فتح / إغلاق ؟

source: Remove open/close if found empty?
ar: إزالة فتح / إغلاق إذا وجدت فارغة؟

source: Open/close click selects row?
ar: فتح / إغلاق انقر فوق الصف المحدد؟

source: Disable the tree?
ar: تعطيل الشجرة؟

source: Show column visibilty menu
ar: إظهار عمود قائمة الرؤية

source: Selection Mode:
ar: : نمط الاختيار

source: No Selection
ar: لاتوجد خيارات

source: Single Interval Selection
ar: اختيار أحادية الفاصل

source: Multiple Interval Selection
ar: اختيار متعددة الفاصل

source: Regular
ar: منتظم

source: Auto-Size
ar: حجم التلقائي

source: Non-default minimal line height
ar: الارتفاع الأدنى الغير الافتراضي للخط

source: Minimal height
ar: أدنى ارتفاع

source: Maximal height
ar: أقصى ارتفاع

source: Wrap handling
ar: التفاف المعالجة

source: The quick brown fox jumps over the lazy dog.
ar: .يقفز الثعلب البني السريع فوق الكلب الكسول

source: Save
ar: حفظ

source: Save the current file.
ar: حفظ الملف الحالي

source: Saving...
ar: ...تسجيل

source: Editor
ar: المحرر

source: File
ar: ملف

source: You can see three buttons in this window: Button in the menu Button in the toolbar Button in the content at the bottom Each of the buttons is configured using the same command and have the same execute listener.
ar: : يمكنك أن ترى ثلاثة أزرار في هذا الإطار زر في القائمة زر في شريط الأدوات زر في أسفل المحتوى ."execute" يتم تكوين كل من الأزرار باستخدام الأمر نفسه ولها نفس المستمع

source: Source
ar: المصدر

source: Enable drag
ar: إتاحة السحب

source: Simple Target
ar: هدف بسيط

source: TextArea Target
ar: هدف مجال النص

source: Reorderable
ar: يمكن إعادة ترتيبها

source: This is a simple example of using a finite state machine, in which virtual mice solve a maze. <p>Each mouse is quite dumb, having in its arsenal of knowledge only these characteristics: it knows only how to travel in a single direction (the direction in which it was instantiated); when it arrives at a new cell, it looks left and right and creates a clone of itself to go each available direction; upon hitting a wall, it dies.<p>The initial mouse is a bit special, in that it looks for the possibility to clone a mouse to travel in the direction behind it, as well as to its left and right.<p>Each mouse is driven by (and in fact, in this example, is a subclass of) a finite state machine. The FSM has five states: FadingIn, CellArrival (look for cloning opportunities), Moving, FadingOut, and Zombie (about to dispose).<p><u>The finite state diagram is below the maze.</u>
ar: .هذا مثال بسيط لاستخدام آلة الدولة المحدودة ، فيه فأرة افتراضية تحل متاهة

source: invalid
ar: مطابق

source: Invalid (%1)
ar: (%1) لاغ

source: disabled
ar: غير متاح

source: disable tooltips
ar: تعطيل التلميحات

source: <b>Validation</b><br/>Press the button to invalidate all shown widgets. Try the invalid focus and tooltip.
ar: <b>التحقق من الصحة</b><br/>.اضغط على الزر لإبطال كافة التطبيقات المصغرة المعروضة. جرب التركيز المبطل وتلميح الأدوات

source: Save?
ar: حفظ؟

source: Age
ar: عمر

source: Registration
ar: التسجيل

source: Name
ar: الاسم

source: Password
ar: كلمة المرور

source: Contact
ar: الإتصال

source: Phone
ar: هاتف

source: Personal Information
ar: البيانات الشخصية

source: Country
ar: المدينة

source: Bio
ar: بيولوجي

source: Please tell us some details about you...
ar: من فضلك أعطنا بعض التفاصيل عنك

source: Send
ar: إرسال

source: send...
ar: ارسال

source: Reset
ar: إعادة ضبط

source: Male
ar: ذكر

source: Female
ar: أنثى

source: username
ar: اسم المستخدم

source: email address
ar: عنوان البريد الالكتروني

source: password
ar: كلمة المرور

source: Accept
ar: قبول

source: Please enter a password at with least 3 characters.
ar: الرجاء إدخال كلمة مرور بحيث لا تقل عن 3 أحرف.

source: Server said no!
ar: قال الملقم أو الخادم لا!

source: Passwords must be equal.
ar: كلمات المرور يجب أن تكون متساوية.

source: Validating...
ar: ...التحقق من

source: You can send...
ar: يمكنك إرسال

source: <b>Client side form validation</b><br/>All fields are required. Some by a custom validator, some by a predefined validator and some by the required flag.
ar: <b>التحقق جهة العميل</b><br/>.جميع المجالات ضرورية. البعض بواسطة مدقق مخصص، والبعض بواسطة مدقق محدد مسبقا و البعض بسبب علامة ضروري

source: Screenshots #1 and #2 show that the label can be reduced in size to 102 pixels horizontally or to 55 pixels vertically, so long as there is enough space in the other direction. Screenshot #3 shows what happens when the label is squeezed down to its minimum height and minimum width.
ar: لقطات من رقم 1 ورقم 2 وتظهر أنه يمكن تخفيض حجم التسمية إلى 102 بكسل أفقيا أو رأسيا إلى 55 بكسل، ما دام هناك مساحة كافية في الاتجاه الآخر. لقطة رقم 3 توضح ما يحدث عندما يتم ضغط التسمية وصولا الى ارتفاعها و عرضها الأدنيين.

source: We would like QLabel to tell the layout that screenshot #1 and screenshot #2 are acceptable but that screenshot #3 is not. The sizeHint() and minimumSizeHint() functions cannot do this, so Qt provides a complementary mechanism: height-for-width.
ar: .كيو تي يوفر آلية تكميلية : ارتفاع مقابل العرض

source: Toggle first paragraph
ar: تبديل الفقرة الأولى

source: qooxdoo is a comprehensive and innovative Ajax application framework. Leveraging object-oriented JavaScript allows developers to build impressive cross-browser applications. No HTML, CSS nor DOM knowledge is needed.
ar: .كوكسدو هو إطار تطبيق أجاكس شامل ومبتكر, زيادة فعالية الشيئية جافا سكريبت يتيح للمطورين بناء تطبيقات مثيرة للإعجاب وتعمل على أي متصفح. لا حاجة لمعرفة سي أس أس، هاش تي أم ال، أو دوم

source: <b>qooxdoo is cool.</b>
ar: <b>. رائع qooxdoo</b>

source: Resize Pane
ar: تغيير حجم الجزء

source: It includes a platform-independent development tool chain, a state-of-the-art GUI toolkit and an advanced client-server communication layer. It is Open Source under an LGPL/EPL dual license.
ar: .كوكسدو تتضمن منصة سلسلة أدوات مستقلة للتنمية، وهي من بين أحدث أدوات واجهة المستخدم الرسومية، و تتضمن أيضا طبقة لاتصالات العميل خادم. هي مصدر مفتوح بموجب ترخيص ال جي بي ال/اي بي ال المزدوج

source: qooxdoo (pronounced [’ku:ksdu:]) is a comprehensive and innovative Ajax application framework. Leveraging object-oriented JavaScript allows developers to build impressive cross-browser applications. No HTML, CSS nor DOM knowledge is needed. qooxdoo includes a platform-independent development tool chain, a state-of-the-art GUI toolkit and an advanced client-server communication layer. It is Open Source under an LGPL/EPL dual license.
ar: كوكسدو (تنطق [كوكس دو]) هو إطار تطبيق أجاكس شامل ومبتكر, زيادة فعالية الشيئية جافا سكريبت يتيح للمطورين بناء تطبيقات مثيرة للإعجاب وتعمل على أي متصفح. كوكسدو تتضمن منصة سلسلة أدوات مستقلة للتنمية، وهي من بين أحدث أدوات واجهة المستخدم الرسومية، و تتضمن أيضا طبقة لاتصالات العميل خادم. لا حاجة لمعرفة سي أس أس، هاش تي أم ال، أو دوم, هي مصدر مفتوح بموجب ترخيص ال جي بي ال/اي بي ال المزدوج.

source: Password:
ar: كلمة المرور

source: next
ar: النالي

source: Email:
ar: البريد الإلكتروني

source: Birthdate:
ar: تاريخ الميلاد

source: back
ar: للخلف

source: submit
ar: إرسال
