Repository: rnapoles/trunk-qooxdoo-contrib-code
Catalog: trunk/qooxdoo-contrib/Translation/0.7.4/showcase/*.po
Languages: cs

source: Choose a locale:
cs: Vyberte jazyk:

source: Cut
cs: Vyříznout

source: Paste
cs: Vložit

source: Copy
cs: Kopírovat

source: Localized ComboBox:
cs: Lokalizovaný výběrový box:

source: A date:
cs: Datum:

source: Undo
cs: Zpět

source: Redo
cs: Znovu

source: Delete
cs: Smazat

source: Select All
cs: Vybrat vše

source: Search
cs: Vyhledat

source: Search Again
cs: Vyhledat znovu

source: Command Menu (keyboard shortcuts)
cs: Nabídka příkazů (klávesových zkratek)

source: Open Color Popup
cs: Otevřít výběr barvy

source: Basic Colors
cs: Základní barvy

source: Template Colors
cs: Barvy šablony

source: Recent Colors
cs: Nedávné barvy

source: Locale information
cs: Informace o jazyce

source: Locale:
cs: Jazyk:

source: Territory code:
cs: Kód teritórie:

source: Date format short:
cs: Krátký formát data:

source: Date short:
cs: Krátké datum:

source: Date format medium:
cs: Střední formát data:

source: Date medium:
cs: Střední datum:

source: Date format long:
cs: Dlouhý formát data:

source: Date long:
cs: Dlouhé datum:

source: Date format full:
cs: Plný formát data:

source: Date full:
cs: Plné datum:

source: Time format short:
cs: Krátký formát času:

source: Time short:
cs: Krátký čas:

source: Time format long:
cs: Dlouhý formát času:

source: Time long:
cs: Dlouhý čas:

source: Week start:
cs: Začátek týdne:

source: Format of %1:
cs: Formát %1:
